Revit 2027 API
BuiltInFailures.RebarFailures.RebarNoConstraints Property
 The constraints for the rebar with free form geometry are not set or modifications have caused the automatic constraints to be deleted. You can use Edit Constraints to assign new bar constraints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarNoConstraints { get; }
Public Shared ReadOnly Property RebarNoConstraints As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarNoConstraints {
	FailureDefinitionId^ get ();
}
static member RebarNoConstraints : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace